In [ ]:
"""
update all to_date with value '9999-01-01' to NULL,
and from_date to '2001-01-01'
"""

In [ ]:
"""SQL table creation and data insertion"""
CREATE TABLE IF NOT EXISTS titles_test (
id int(11) not null primary key,
emp_no int(11) NOT NULL,
title varchar(50) NOT NULL,
from_date date NOT NULL,
to_date date DEFAULT NULL);

insert into titles_test values ('1', '10001', 'Senior Engineer', '1986-06-26', '9999-01-01'),
('2', '10002', 'Staff', '1996-08-03', '9999-01-01'),
('3', '10003', 'Senior Engineer', '1995-12-03', '9999-01-01'),
('4', '10004', 'Senior Engineer', '1995-12-03', '9999-01-01'),
('5', '10001', 'Senior Engineer', '1986-06-26', '9999-01-01'),
('6', '10002', 'Staff', '1996-08-03', '9999-01-01'),
('7', '10003', 'Senior Engineer', '1995-12-03', '9999-01-01');

In [ ]:
"""SQL solution"""
UPDATE title_test
SET to_date = NULL,
    from_date = '2001-01-01'
WHERE to_date = '9999-01-01'

In [1]:
"""pandas datafrmame creation"""
import numpy as np
import pandas as pd

tt = np.array([['1', '10001', 'Senior Engineer', '1986-06-26', '9999-01-01'],
               ['2', '10002', 'Staff', '1996-08-03', '9999-01-01'],
               ['3', '10003', 'Senior Engineer', '1995-12-03', '9999-01-01'],
               ['4', '10004', 'Senior Engineer', '1995-12-03', '9999-01-01'],
               ['5', '10001', 'Senior Engineer', '1986-06-26', '9999-01-01'],
               ['6', '10002', 'Staff', '1996-08-03', '9999-01-01'],
               ['7', '10003', 'Senior Engineer', '1995-12-03', '9999-01-01']])
titles_test = pd.DataFrame(data=tt, columns=['id', 'emp_no', 'title', 'from_date', 'to_date'])
titles_test.head()

  id emp_no            title   from_date     to_date
0  1  10001  Senior Engineer  1986-06-26  9999-01-01
1  2  10002            Staff  1996-08-03  9999-01-01
2  3  10003  Senior Engineer  1995-12-03  9999-01-01
3  4  10004  Senior Engineer  1995-12-03  9999-01-01
4  5  10001  Senior Engineer  1986-06-26  9999-01-01

In [19]:
titles_test.loc[titles_test['to_date'] == '9999-01-01', ['from_date', 'to_date']] = ['2001-01-01', 'NULL']